; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-4-2-19)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	package17 - package
	package18 - package
	package19 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	p0-1 - location
	p0-7 - location
	p1-2 - location
	p1-3 - location
	p1-5 - location
	p2-5 - location
	p2-7 - location
	p3-2 - location
	p3-4 - location
	p3-6 - location
	p4-0 - location
	p4-2 - location
	p5-0 - location
	p7-1 - location
	)
	(:init
	(at driver1 s1)
	(at driver2 s0)
	(at driver3 s2)
	(at driver4 s5)
	(at truck1 s3)
	(empty truck1)
	(at truck2 s6)
	(empty truck2)
	(at package1 s0)
	(at package2 s2)
	(at package3 s0)
	(at package4 s0)
	(at package5 s1)
	(at package6 s6)
	(at package7 s4)
	(at package8 s6)
	(at package9 s7)
	(at package10 s4)
	(at package11 s2)
	(at package12 s7)
	(at package13 s2)
	(at package14 s7)
	(at package15 s6)
	(at package16 s6)
	(at package17 s4)
	(at package18 s6)
	(at package19 s6)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-7)
	(path p0-7 s0)
	(path s7 p0-7)
	(path p0-7 s7)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(path s2 p2-5)
	(path p2-5 s2)
	(path s5 p2-5)
	(path p2-5 s5)
	(path s2 p2-7)
	(path p2-7 s2)
	(path s7 p2-7)
	(path p2-7 s7)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(path s3 p3-6)
	(path p3-6 s3)
	(path s6 p3-6)
	(path p3-6 s6)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(path s4 p4-2)
	(path p4-2 s4)
	(path s2 p4-2)
	(path p4-2 s2)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(path s7 p7-1)
	(path p7-1 s7)
	(path s1 p7-1)
	(path p7-1 s1)
	(link s0 s2)
	(link s2 s0)
	(link s0 s3)
	(link s3 s0)
	(link s0 s4)
	(link s4 s0)
	(link s0 s5)
	(link s5 s0)
	(link s0 s7)
	(link s7 s0)
	(link s1 s6)
	(link s6 s1)
	(link s2 s3)
	(link s3 s2)
	(link s2 s4)
	(link s4 s2)
	(link s2 s5)
	(link s5 s2)
	(link s2 s6)
	(link s6 s2)
	(link s3 s1)
	(link s1 s3)
	(link s5 s1)
	(link s1 s5)
	(link s5 s7)
	(link s7 s5)
	(link s6 s3)
	(link s3 s6)
	(link s7 s1)
	(link s1 s7)
	(link s7 s3)
	(link s3 s7)
	(link s7 s4)
	(link s4 s7)
	(link s7 s6)
	(link s6 s7)
)
	(:goal (and
	(at driver1 s1)
	(at driver2 s6)
	(at truck1 s7)
	(at truck2 s2)
	(at package1 s7)
	(at package2 s4)
	(at package3 s7)
	(at package4 s4)
	(at package5 s5)
	(at package6 s5)
	(at package7 s0)
	(at package9 s1)
	(at package10 s7)
	(at package11 s7)
	(at package12 s2)
	(at package13 s3)
	(at package14 s3)
	(at package15 s4)
	(at package16 s3)
	(at package17 s7)
	(at package18 s6)
	(at package19 s5)
	))


)

; plan
1. (walk driver3 s2 p3-2)
   deleted: (at driver3 s2)
   added: (at driver3 p3-2)
   goals met: 2 of 22
2. (walk driver3 p3-2 s3)
   deleted: (at driver3 p3-2)
   added: (at driver3 s3)
   goals met: 2 of 22
3. (board-truck driver3 s3 truck1)
   deleted: (at driver3 s3) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 2 of 22
4. (drive-truck driver3 s3 s0 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   goals met: 2 of 22
5. (drive-truck driver3 s0 s7 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s7)
   goals met: 3 of 22
6. (load-truck s7 package9 truck1)
   deleted: (at package9 s7)
   added: (in package9 truck1)
   goals met: 3 of 22
7. (load-truck s7 package14 truck1)
   deleted: (at package14 s7)
   added: (in package14 truck1)
   goals met: 3 of 22
8. (load-truck s7 package12 truck1)
   deleted: (at package12 s7)
   added: (in package12 truck1)
   goals met: 3 of 22
9. (drive-truck driver3 s7 s3 truck1)
   deleted: (at truck1 s7)
   added: (at truck1 s3)
   goals met: 2 of 22
10. (drive-truck driver3 s3 s2 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   goals met: 2 of 22
11. (load-truck s2 package2 truck1)
   deleted: (at package2 s2)
   added: (in package2 truck1)
   goals met: 2 of 22
12. (load-truck s2 package13 truck1)
   deleted: (at package13 s2)
   added: (in package13 truck1)
   goals met: 2 of 22
13. (unload-truck s2 package12 truck1)
   deleted: (in package12 truck1)
   added: (at package12 s2)
   goals met: 3 of 22
14. (load-truck s2 package11 truck1)
   deleted: (at package11 s2)
   added: (in package11 truck1)
   goals met: 3 of 22
15. (drive-truck driver3 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 3 of 22
16. (drive-truck driver3 s0 s3 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s3)
   goals met: 3 of 22
17. (drive-truck driver3 s3 s7 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s7)
   goals met: 4 of 22
18. (unload-truck s7 package11 truck1)
   deleted: (in package11 truck1)
   added: (at package11 s7)
   goals met: 5 of 22
19. (drive-truck driver3 s7 s3 truck1)
   deleted: (at truck1 s7)
   added: (at truck1 s3)
   goals met: 4 of 22
20. (unload-truck s3 package14 truck1)
   deleted: (in package14 truck1)
   added: (at package14 s3)
   goals met: 5 of 22
21. (drive-truck driver3 s3 s6 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s6)
   goals met: 5 of 22
22. (walk driver2 s0 p4-0)
   deleted: (at driver2 s0)
   added: (at driver2 p4-0)
   goals met: 5 of 22
23. (drive-truck driver3 s6 s7 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s7)
   goals met: 6 of 22
24. (walk driver2 p4-0 s4)
   deleted: (at driver2 p4-0)
   added: (at driver2 s4)
   goals met: 6 of 22
25. (walk driver2 s4 p3-4)
   deleted: (at driver2 s4)
   added: (at driver2 p3-4)
   goals met: 6 of 22
26. (walk driver2 p3-4 s3)
   deleted: (at driver2 p3-4)
   added: (at driver2 s3)
   goals met: 6 of 22
27. (walk driver2 s3 p3-6)
   deleted: (at driver2 s3)
   added: (at driver2 p3-6)
   goals met: 6 of 22
28. (walk driver2 p3-6 s6)
   deleted: (at driver2 p3-6)
   added: (at driver2 s6)
   goals met: 7 of 22
29. (board-truck driver2 s6 truck2)
   deleted: (at driver2 s6) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 6 of 22
30. (drive-truck driver3 s7 s0 truck1)
   deleted: (at truck1 s7)
   added: (at truck1 s0)
   goals met: 5 of 22
31. (load-truck s0 package4 truck1)
   deleted: (at package4 s0)
   added: (in package4 truck1)
   goals met: 5 of 22
32. (drive-truck driver3 s0 s4 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s4)
   goals met: 5 of 22
33. (load-truck s4 package7 truck1)
   deleted: (at package7 s4)
   added: (in package7 truck1)
   goals met: 5 of 22
34. (unload-truck s4 package4 truck1)
   deleted: (in package4 truck1)
   added: (at package4 s4)
   goals met: 6 of 22
35. (drive-truck driver3 s4 s0 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s0)
   goals met: 6 of 22
36. (unload-truck s0 package7 truck1)
   deleted: (in package7 truck1)
   added: (at package7 s0)
   goals met: 7 of 22
37. (load-truck s0 package3 truck1)
   deleted: (at package3 s0)
   added: (in package3 truck1)
   goals met: 7 of 22
38. (drive-truck driver3 s0 s4 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s4)
   goals met: 7 of 22
39. (drive-truck driver3 s4 s7 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s7)
   goals met: 8 of 22
40. (unload-truck s7 package3 truck1)
   deleted: (in package3 truck1)
   added: (at package3 s7)
   goals met: 9 of 22
41. (load-truck s6 package6 truck2)
   deleted: (at package6 s6)
   added: (in package6 truck2)
   goals met: 9 of 22
42. (load-truck s6 package19 truck2)
   deleted: (at package19 s6)
   added: (in package19 truck2)
   goals met: 9 of 22
43. (load-truck s6 package16 truck2)
   deleted: (at package16 s6)
   added: (in package16 truck2)
   goals met: 9 of 22
44. (drive-truck driver2 s6 s2 truck2)
   deleted: (at truck2 s6)
   added: (at truck2 s2)
   goals met: 10 of 22
45. (drive-truck driver3 s7 s1 truck1)
   deleted: (at truck1 s7)
   added: (at truck1 s1)
   goals met: 9 of 22
46. (unload-truck s1 package9 truck1)
   deleted: (in package9 truck1)
   added: (at package9 s1)
   goals met: 10 of 22
47. (drive-truck driver3 s1 s7 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s7)
   goals met: 11 of 22
48. (drive-truck driver3 s7 s4 truck1)
   deleted: (at truck1 s7)
   added: (at truck1 s4)
   goals met: 10 of 22
49. (unload-truck s4 package2 truck1)
   deleted: (in package2 truck1)
   added: (at package2 s4)
   goals met: 11 of 22
50. (drive-truck driver3 s4 s7 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s7)
   goals met: 12 of 22
51. (drive-truck driver3 s7 s1 truck1)
   deleted: (at truck1 s7)
   added: (at truck1 s1)
   goals met: 11 of 22
52. (load-truck s1 package5 truck1)
   deleted: (at package5 s1)
   added: (in package5 truck1)
   goals met: 11 of 22
53. (drive-truck driver3 s1 s7 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s7)
   goals met: 12 of 22
54. (drive-truck driver3 s7 s0 truck1)
   deleted: (at truck1 s7)
   added: (at truck1 s0)
   goals met: 11 of 22
55. (load-truck s0 package1 truck1)
   deleted: (at package1 s0)
   added: (in package1 truck1)
   goals met: 11 of 22
56. (drive-truck driver3 s0 s7 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s7)
   goals met: 12 of 22
57. (unload-truck s7 package1 truck1)
   deleted: (in package1 truck1)
   added: (at package1 s7)
   goals met: 13 of 22
58. (drive-truck driver3 s7 s3 truck1)
   deleted: (at truck1 s7)
   added: (at truck1 s3)
   goals met: 12 of 22
59. (unload-truck s3 package13 truck1)
   deleted: (in package13 truck1)
   added: (at package13 s3)
   goals met: 13 of 22
60. (drive-truck driver3 s3 s7 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s7)
   goals met: 14 of 22
61. (drive-truck driver3 s7 s4 truck1)
   deleted: (at truck1 s7)
   added: (at truck1 s4)
   goals met: 13 of 22
62. (load-truck s4 package17 truck1)
   deleted: (at package17 s4)
   added: (in package17 truck1)
   goals met: 13 of 22
63. (drive-truck driver3 s4 s7 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s7)
   goals met: 14 of 22
64. (unload-truck s7 package17 truck1)
   deleted: (in package17 truck1)
   added: (at package17 s7)
   goals met: 15 of 22
65. (drive-truck driver3 s7 s5 truck1)
   deleted: (at truck1 s7)
   added: (at truck1 s5)
   goals met: 14 of 22
66. (unload-truck s5 package5 truck1)
   deleted: (in package5 truck1)
   added: (at package5 s5)
   goals met: 15 of 22
67. (drive-truck driver3 s5 s7 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s7)
   goals met: 16 of 22
68. (drive-truck driver3 s7 s4 truck1)
   deleted: (at truck1 s7)
   added: (at truck1 s4)
   goals met: 15 of 22
69. (load-truck s4 package10 truck1)
   deleted: (at package10 s4)
   added: (in package10 truck1)
   goals met: 15 of 22
70. (drive-truck driver3 s4 s7 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s7)
   goals met: 16 of 22
71. (unload-truck s7 package10 truck1)
   deleted: (in package10 truck1)
   added: (at package10 s7)
   goals met: 17 of 22
72. (drive-truck driver2 s2 s5 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s5)
   goals met: 16 of 22
73. (unload-truck s5 package6 truck2)
   deleted: (in package6 truck2)
   added: (at package6 s5)
   goals met: 17 of 22
74. (drive-truck driver2 s5 s2 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s2)
   goals met: 18 of 22
75. (drive-truck driver2 s2 s6 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s6)
   goals met: 17 of 22
76. (load-truck s6 package15 truck2)
   deleted: (at package15 s6)
   added: (in package15 truck2)
   goals met: 17 of 22
77. (drive-truck driver2 s6 s2 truck2)
   deleted: (at truck2 s6)
   added: (at truck2 s2)
   goals met: 18 of 22
78. (drive-truck driver2 s2 s3 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s3)
   goals met: 17 of 22
79. (unload-truck s3 package16 truck2)
   deleted: (in package16 truck2)
   added: (at package16 s3)
   goals met: 18 of 22
80. (drive-truck driver2 s3 s2 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s2)
   goals met: 19 of 22
81. (drive-truck driver2 s2 s4 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s4)
   goals met: 18 of 22
82. (unload-truck s4 package15 truck2)
   deleted: (in package15 truck2)
   added: (at package15 s4)
   goals met: 19 of 22
83. (drive-truck driver2 s4 s2 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s2)
   goals met: 20 of 22
84. (drive-truck driver2 s2 s5 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s5)
   goals met: 19 of 22
85. (unload-truck s5 package19 truck2)
   deleted: (in package19 truck2)
   added: (at package19 s5)
   goals met: 20 of 22
86. (drive-truck driver2 s5 s2 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s2)
   goals met: 21 of 22
87. (walk driver4 s5 p1-5)
   deleted: (at driver4 s5)
   added: (at driver4 p1-5)
   goals met: 21 of 22
88. (walk driver4 p1-5 s1)
   deleted: (at driver4 p1-5)
   added: (at driver4 s1)
   goals met: 21 of 22
89. (walk driver4 s1 p1-3)
   deleted: (at driver4 s1)
   added: (at driver4 p1-3)
   goals met: 21 of 22
90. (walk driver4 p1-3 s3)
   deleted: (at driver4 p1-3)
   added: (at driver4 s3)
   goals met: 21 of 22
91. (walk driver4 s3 p3-6)
   deleted: (at driver4 s3)
   added: (at driver4 p3-6)
   goals met: 21 of 22
92. (walk driver4 p3-6 s6)
   deleted: (at driver4 p3-6)
   added: (at driver4 s6)
   goals met: 21 of 22
93. (drive-truck driver2 s2 s6 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s6)
   goals met: 20 of 22
94. (disembark-truck driver2 s6 truck2)
   deleted: (driving driver2 truck2)
   added: (at driver2 s6) (empty truck2)
   goals met: 21 of 22
95. (board-truck driver4 s6 truck2)
   deleted: (at driver4 s6) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 21 of 22
96. (drive-truck driver4 s6 s2 truck2)
   deleted: (at truck2 s6)
   added: (at truck2 s2)
   goals met: 22 of 22
